package leetcode.com.pickup1.easy;

/**
 * Created by tclresearchamerica on 7/29/16.
 * ****************************************************
 * Location:
 * https://leetcode.com/problems/palindrome-number/
 * ****************************************************
 * Description:
 * Determine whether an integer is a palindrome. Do this without extra space.
 * ****************************************************
 * Thought:
 * 1.对称的数字?如何判断呢?原来超简单,就是不断的除法,然后复原得到一个新数字,判断他们是否相等
 * 2.负数不是对称数字
 * ****************************************************
 * Time: 10 mins
 * Beat: 50%
 * Bug: 1
 * ****************************************************
 * ****************************************************
 * ****************************************************
 * ****************************************************
 * ****************************************************
 * ****************************************************
 * ****************************************************
 * ****************************************************
 * ****************************************************
 * ****************************************************
 */
public class No009_Palindrome_Number {

    public boolean isPalindrome(int x) {
        //bug1:负数不是对称数字哦,面试的时候,要口头确认先,
        if (x<0)return false;
        int newX = x;
        int y = 0;
        while (newX != 0) {
            y = newX % 10 + 10 * y;
            newX /= 10;
        }

        return y == x;
    }
}
